Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/telecommunications_and_postal_services/dealing_with_unsolicited_direct_marketing.html.txt.tmx
Source language: en
Languages: ga

source: Dealing with unsolicited direct marketing
ga: Deileáil le margaíocht díreach nár iarradh

source: Many people do not object to receiving unsolicited mail of an advertising or promotional nature through the post
ga: Tá go leor daoine ann nár miste leo litreacha gan iarraidh a bhaineann le fógraíocht agus margaíocht a fháil sa phost

source: For some people however, such mail is "junk mail"; a nuisance that they wish to avoid
ga: Ach, tá daoine eile ann, a chreideann gur mór an crá croí é an "dramhphost"

source: The Data Protection Act, 1988 contains a special provision to ensure people who do not wish to receive direct marketing literature - either through the post, over the phone or over the internet - should have their privacy respected
ga: Tá an tAcht um Chosaint Sonraí, 1988 ann le cinntiú gur féidir le daoine nach mian leo ábhar margaíochta dírí a fháil - bíodh sé tríd an bpost, ar an teileafón nó ar an Idirlíon - a bpríobháideachas a chosaint

source: The Irish Direct Marketing Association (IDMA), the representative body for direct marketers in Ireland, operates a "Mailing Preference Service"
ga: Tá "Príomhsheirbhís Phoist" dhá rith ag Cumann na hÉireann um Mhargaíocht Díreach (IDMA), eagraíocht ionadaíochta do lucht margaíochta dírí in Éirinn, i gcomhair le An Post

source: Contact the IDMA to ask for your details to be removed from the marketing databases of the main direct marketers in Ireland and you should receive fewer unwanted mailings
ga: Má chuireann tú do chuid sonraí teagmhála chuig An Post, bainfear iad de na bancanna sonraí atá ag na príomhchomhlachtaí margaíochta dírí in Éirinn agus ba cheart go mbeadh laghdú mór ar an méid poist gan iarraidh a fhaigheann tú

source: You can fill in the Mail Preference Service application form online or download it from their website
ga: Is féidir leat a líonadh isteach ar líne ar an tSeirbhís Tosaíochta Mail foirm iarratais nó é a íoslódáil ón suíomh idirlín IDMA

source: The IDMA has also instituted a Code of Practice on Data Protection, setting out the data protection rules that IDMA members must adhere to
ga: Tá Cód Iompair um Chosaint Sonraí, ag an IDMA a leagann síos na rialacha um chosaint sonraí nach mór do bhaill an IDMA cloí leo

source: The right to have your name removed from a direct marketing database
ga: Do cheart d’ainm a bhaint ó bhanc sonraí um mhargaíocht díreach

source: Under section 2(7) of the Data Protection Act, you have the right to have your details removed from a direct marketing database
ga: Faoi mhír 2(7) den Acht um Chosaint Sonraí, tá sé de cheart agat do chuid sonraí a bhaint ó bhanc sonraí um mhargaíocht díreach

source: To do this, you should write to the organisation keeping the database and ask it to remove your details
ga: Ar mhaithe len é seo a dhéanamh ba cheart duit scríobh chuig an eagraíocht a bhfuil an banc sonraí aici agus iarraidh uirthi do chuid sonraí a bhaint

source: The organisation must comply with your request and write back to you within 40 days, confirming that your request has been complied with
ga: Ní mór don eagraíocht d'iarratas a shásamh agus scríobh ar ais chugat taobh istigh de 40 lá, ag insint duit go bhfuil déanta de réir do thola

source: If the direct marketing organisation keeps your details for direct marketing purposes, and also for some other purpose, then it must stop using the details for direct marketing
ga: Má bhíonn do chuid sonraí coinnithe ag an eagraíocht um mhargaíocht díreach ar mhaithe le margaíocht díreach agus ar chúis eile freisin, ní mór di stop a chur le do chuid sonraí a úsáid ar mhaithe le margaíocht díreach

source: However, in this case, the organisation may continue to keep and use your details for other purpose, provided of course that there is no breach of data protection law involved
ga: Ach, sa chás seo, is féidir leis an eagraíocht do chuid sonraí a choinneáil agus a úsáid don chúis eile, chomh fada nach bhfuil sí ag sárú an dlí a bhaineann le cosaint sonraí

source: The organisation must inform you about the other purposes it is keeping your details for
ga: Ní mór don eagraíocht a chur in iúl duit cén fáth eile atá aici le do chuid sonraí a choinneáil

source: Irish Direct Marketing Association
ga: Cumann na hÉireann um Mhargaíocht Díreach

source: Tel:+353 (0)86 262 6781
ga: Teil:+353 (0)86 262 6781

source: A guide to dealing with unsolicited direct marketing is available on the website of the Data Protection Commissioner
ga: Tá treoir le déileáil le margaíocht dhíreach gan iarraidh fáil ar shuíomh gréasáin an Choimisinéara Cosanta Sonraí
